package lesson6.homework.Advanced;

public class Task1 {
    public static void main(String[] args) {

    }
}
//Задача №1
//1. Создать следующую структуру из классов и интерфейсов:
// дерево -> ель (имеет шишки, умеет пахнуть)
// дерево -> сосна (имеет шишки, умеет пахнуть)
// растение -> роза (умеет цвести, умеет пахнуть)
// растение -> папоротник (умеет цвести)
// Создать у каждого класса по объекту, распределить по массивам интерфейсов
// И у каждого массива вызвать характерный метод
//Ожидание:
// сосна : умеет пахнуть
// ель : умееть пахнуть
// роза: умееть пахнуть
// роза: умеет цвести
// папоротник: умеет цвести